app/Controllers/admin/PostsController.php

    public function detail($slug)
    {
        $data = [
            'title' => 'Detail Post',
            'post' => $this->postsModel->where(['slug' => $slug])->first(),
            'selectedApprover1' => $this->postsModel->where('slug', $slug)->select('uid_approver_1')->first()['uid_approver_1'] ?? '',
            'selectedApprover2' => $this->postsModel->where('slug', $slug)->select('uid_approver_2')->first()['uid_approver_2'] ?? '',
---
SELECT *
FROM `posts`
WHERE `slug` = 'why-is-technology-important-in-todays-world'
 LIMIT 1
SELECT `uid_approver_1`
FROM `posts`
WHERE `slug` = 'why-is-technology-important-in-todays-world'
 LIMIT 1
SELECT `uid_approver_2`
FROM `posts`
WHERE `slug` = 'why-is-technology-important-in-todays-world'
 LIMIT 1