app/Controllers/writer/PostsController.php

SELECT *
FROM `posts`
WHERE `user_id` = '4'
---
    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');

        if (!$userId) {
            return view('errors/unauthorized');
        }

        $posts = $this->postsModel->where('user_id', $userId)->findAll();

SELECT *
FROM `posts`
WHERE `slug` = 'why-is-technology-important-in-todays-world'
 LIMIT 1
---
    public function detail($slug)
    {
        $post = $this->postsModel->where(['slug' => $slug])->first();