app/Controllers/approver/MyProfileController.php

    public function updateUserDetail()
    {
        $session = session();
        $userId = $session->get('user_id');

        if (!$userId) {
            return view('errors/unauthorized');
        }

        // Validasi Input
        $validation = $this->validate([
            'username'  => 'required',
            'name'      => 'required|min_length[3]|max_length[100]',
            'email'     => 'required|valid_email',
        ]);

        if (!$validation) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors()) // Untuk error spesifik per field
                ->with('error', 'Make sure you have entered the data correctly.'); // Untuk notifikasi global
        }

        // Ambil data lama dari database
        $oldData = $this->usersModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'

        }

        // Jika ada perubahan, lakukan update
        $this->usersModel->update($userId, $newData);
---
UPDATE `users` SET `username` = 'smithh', `name` = 'Smith', `email` = 'Smith@gmail.com', `updated_at` = '2025-04-25 10:48:06'
WHERE `users`.`id` IN ('6')