app/Controllers/approver/PostsController.php

    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');

        if (!$userId) {
            return view('errors/unauthorized');
        }

        $posts = $this->postsModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `posts`
WHERE `user_id` = '6'

    public function detail($slug)
    {
        $post = $this->postsModel->where(['slug' => $slug])->first();
---
SELECT *
FROM `posts`
WHERE `slug` = 'cara-menerapkan-filter-berdasarkan-user-id'
 LIMIT 1