app/Controllers/approver/PostsApprovalController.php

    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');

        if (!$userId) {
            return view('errors/unauthorized');
        }

        $posts = $this->postsModel->where('uid_approver_1', $userId)->findAll();
---
SELECT *
FROM `posts`
WHERE `uid_approver_1` = '6'

    public function detail($slug)
    {
        $post = $this->postsModel->where(['slug' => $slug])->first();
---
SELECT *
FROM `posts`
WHERE `slug` = 'cara-menerapkan-filter-berdasarkan-user-id'
 LIMIT 1

    public function updateStatus($slug)
    {
        $status_1 = $this->request->getPost('status_1');

        // Ambil data post berdasarkan slug
        $post = $this->postsModel->where('slug', $slug)->first();

        if (!$post) {
            return redirect()->to(base_url('approver/post_approval_detail/' . $slug))->with('error', 'Post not found.');
        }

        // Logika perubahan status berdasarkan Approver 1
        if ($status_1 !== null && $post['post_status'] === 'Waiting Approval 1') {
            if ($status_1 === 'Approved') {
                $newStatus = 'Waiting Approval 2';
            } elseif ($status_1 === 'Need Revision') {
                $newStatus = 'Need Revision 1';
            }

            $this->postsModel->where('slug', $slug)->set([
                'post_status' => $newStatus,
                'status_1' => $status_1
            ])->update();
---
SELECT *
FROM `posts`
WHERE `slug` = 'cara-menerapkan-filter-berdasarkan-user-id'
 LIMIT 1
UPDATE `posts` SET `post_status` = 'Waiting Approval 2', `status_1` = 'Approved', `updated_at` = '2025-04-24 04:59:13'
WHERE `slug` = 'cara-menerapkan-filter-berdasarkan-user-id'