app/Controllers/AuthController.php

    public function login()
    {
        $validationRules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->usersModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin1'
 LIMIT 1