app/Models/UsersModel.php

SELECT `id`, `username`, `name`, `email`, `role`
FROM `users`
---
    public function getAllUsers()
    {
        return $this->select('id, username, name, email, role')->findAll();

SELECT `id`, `username`, `name`, `email`, `role`
FROM `users`
WHERE `id` = '6'
 LIMIT 1
---
    public function getUserById($id)
    {
        return $this->select('id, username, name, email, role')->where('id', $id)->first();

SELECT `name`
FROM `users`
WHERE `id` = '6'
 LIMIT 1
---
    public function getApproversName($id)
    {
        return $this->select('name')->where('id', $id)->first();

SELECT `id`, `username`, `name`, `email`, `role`, `is_active`
FROM `users`
WHERE `id` = '3'
 LIMIT 1
---
    public function getUserDetail($id)
    {
        return $this->select('id, username, name, email, role, is_active')->where('id', $id)->first();

SELECT `id`, `name`
FROM `users`
WHERE `role` = 'approver'
AND `is_active` = 1
---
    public function getApprovers1()
    {
        return $this->select('id, name')
            ->where('role', 'approver')
            ->where('is_active', 1)
            ->findAll();

SELECT `id`, `name`
FROM `users`
WHERE `role` = 'admin'
AND `is_active` = 1
---
    public function getApprovers2()
    {
        return $this->select('id, name')
            ->where('role', 'admin')
            ->where('is_active', 1)
            ->findAll();